core/app/Http/Controllers/DepositController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `deposits` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `deposits` where `user_id` = 1 and `payment_status` = 1
---
    public function depositLog(Request $request)
    {

        $pageTitle = "Transactions";

        $transactions = Deposit::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->latest()->with('user')->where('payment_status', 1)->paginate();