core/app/Http/Controllers/SiteController.php

    public function index()
    {

        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();
---
select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1

    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();
---
select * from `pages` where `slug` = 'favicon.ico' limit 1

    public function investLog(Request $request)
    {
        $pageTitle = 'Invest Log';

        $business_pack_invests = BusinessPackPayment::when($request->pack_date, function ($item) use ($request) {
                $item->whereDate('created_at', $request->pack_date);
            })->where('user_id', auth()->id())->paginate();
        $business_value_invests = BusinessValuePayment::when($request->value_date, function ($item) use ($request) {
                $item->whereDate('created_at', $request->value_date);
            })->where('user_id', auth()->id())->paginate();
---
select * from `business_pack_payments` where `user_id` = 1 limit 15 offset 0
select count(*) as aggregate from `business_pack_payments` where `user_id` = 1
select * from `business_value_payments` where `user_id` = 1 limit 15 offset 0
select count(*) as aggregate from `business_value_payments` where `user_id` = 1