core/app/Http/Controllers/UserController.php

select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select count(*) as aggregate from `payments` where `user_id` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 1
select * from `user_interests` where `user_id` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `user_interests` where `user_id` = 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 1 and `payment_status` = 1
select * from `gateways` where `is_created` = 1 order by `created_at` desc limit 1
select * from `wallet_profits` limit 1
---
    public function dashboard()
    {

        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');

        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();

        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');
        $gateway = Gateway::where('is_created',1)->latest()->first();
        $settings = WalletProfits::first();

select * from `withdraw_gateways` where `status` = 1 order by `created_at` desc
---
    public function withdraw()
    {
        $pageTitle = 'Withdraw Money';

        $withdraws = WithdrawGateway::where('status', 1)->latest()->get();

select * from `withdraw_gateways` where `withdraw_gateways`.`id` = '3' limit 1
---
    public function withdrawFetch(Request $request)
    {
        $withdraw = WithdrawGateway::findOrFail($request->id);

select * from `withdraws` where `user_id` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `withdraws` where `user_id` = 1
---
    public function allWithdraw(Request $request)
    {
        $pageTitle = 'All withdraw';

        $withdrawlogs = Withdraw::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->latest()->with('withdrawMethod')->paginate(10);

select count(*) as aggregate from `withdraws` where `user_id` = 1 and `status` = 0
---
    public function pendingWithdraw()
    {
        $pageTitle = 'Pending withdraw';

        $withdrawlogs = Withdraw::where('user_id', auth()->id())->where('status', 0)->latest()->with('withdrawMethod')->paginate(10);

select * from `withdraws` where `user_id` = 1 and `status` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `withdraws` where `user_id` = 1 and `status` = 1
---
    public function completeWithdraw()
    {
        $pageTitle = 'Complete withdraw';

        $withdrawlogs = Withdraw::where('user_id', auth()->id())->where('status', 1)->latest()->with('withdrawMethod')->paginate(10);

select * from `reffered_commissions` where `reffered_by` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `reffered_commissions` where `reffered_by` = 1
---
    public function commision(Request $request)
    {

        $pageTitle = 'Complete withdraw';

        $commison = RefferedCommission::when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('reffered_by', Auth::id())->latest()->paginate(10, ['*'], 'commison');

select * from `payments` where `user_id` = 1 and `payment_status` != 0 order by `created_at` desc
---
    public function allInvest()
    {
        $data['payments'] = Payment::where('user_id', Auth::id())->where('payment_status', '!=', 0)->latest()->get();