core/app/Http/Controllers/UserController.php

    public function withdrawFetch(Request $request)
    {
        $withdraw = WithdrawGateway::findOrFail($request->id);
---
select * from `withdraw_gateways` where `withdraw_gateways`.`id` in (3)