core/app/Http/Helpers/helpers.php

function filePath($folder_name)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function getFile($folder_name, $filename)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function content($key)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->first();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 2 and `key` = 'contact.content' limit 1

function element($key, $take = 10)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->take($take)->get();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 2 and `key` = 'footer.element' limit 10

function template()
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1