core/app/Providers/AppServiceProvider.php

    public function boot()
    {


        $general = GeneralSetting::first();


        View::composer('backend.layout.sidebar', function ($view) {
            $deactiveUser = User::where('status',0)->count();
            $view->with('deactiveUser',  $deactiveUser);
        });


        View::composer('backend.layout.navbar', function ($view) {
            $notifications = auth()->guard('admin')->user()->unreadNotifications()->where('type', NewUserNotification::class)->get();
            $view->with('notifications',  $notifications);

            $depositNotifications = auth()->guard('admin')->user()->unreadNotifications()->where('type', DepositNotification::class)->get();
            $view->with('depositNotifications', $depositNotifications);
        });


        View::composer('backend.layout.navbar', function ($view) {
            $pendingpayment = Payment::where('payment_status',2)->get();
            $view->with('pendingpayment',  $pendingpayment);
        });

        View::composer('backend.layout.navbar', function ($view) {
            $pendingWithdraw = Withdraw::where('status',0)->get();
---
select count(*) as aggregate from `users` where `status` = 0
select * from `payments` where `payment_status` = 2
select * from `withdraws` where `status` = 0

        });

        View::composer('backend.layout.navbar', function ($view) {
            $pendingTicket= Ticket::where('status',2)->get();
---
select * from `tickets` where `status` = 2