core/app/Http/Controllers/Auth/LoginController.php

select * from `general_settings` limit 1
select * from `users` where `username` = 'username' limit 1
---
    public function login(Request $request)
    {
        $general  = GeneralSetting::first();
        $request->validate([
            'username' => 'required',
            'password' => 'required',
            'g-recaptcha-response' => Rule::requiredIf($general->allow_recaptcha == 1)
        ], [
            'g-recaptcha-response.required' => 'You Have To fill recaptcha'
        ]);


        $user = User::where('username', $request->username)->first();